; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p19---int100n150-m25---int100c110---s545---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level1 level3 level4)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level2 level3 level5)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level3 level3 level6)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level4 level3 level7)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level5 level3 level8)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level6 level3 level9)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level7 level3 level10)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level8 level3 level11)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level9 level3 level12)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level10 level3 level13)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level11 level3 level14)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level12 level3 level15)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level13 level3 level16)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level14 level3 level17)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level15 level3 level18)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level16 level3 level19)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level17 level3 level20)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level18 level3 level21)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level19 level3 level22)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level20 level3 level23)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level21 level3 level24)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level22 level3 level25)
(sum level22 level12 level34)
(sum level23 level3 level26)
(sum level24 level3 level27)
(sum level25 level3 level28)
(sum level26 level3 level29)
(sum level27 level3 level30)
(sum level28 level3 level31)
(sum level29 level3 level32)
(sum level30 level3 level33)
(sum level31 level3 level34)

(connected l0 l1)
(fuelcost level3 l0 l1)
(connected l0 l2)
(fuelcost level13 l0 l2)
(connected l1 l0)
(fuelcost level3 l1 l0)
(connected l1 l2)
(fuelcost level12 l1 l2)
(connected l2 l0)
(fuelcost level13 l2 l0)
(connected l2 l1)
(fuelcost level12 l2 l1)

(at t0 l1)
(fuel t0 level34)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l0)
(at p3 l0)
(at p4 l0)
(at p5 l2)
(at p6 l1)
(at p7 l1)
(at p8 l0)
(at p9 l1)
(at p10 l2)
(at p11 l2)
(at p12 l0)
(at p13 l2)
(at p14 l1)
(at p15 l1)
(at p16 l1)
(at p17 l2)
(at p18 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l1)
(at p3 l2)
(at p4 l1)
(at p5 l1)
(at p6 l0)
(at p7 l0)
(at p8 l2)
(at p9 l2)
(at p10 l0)
(at p11 l0)
(at p12 l1)
(at p13 l1)
(at p14 l2)
(at p15 l2)
(at p16 l2)
(at p17 l1)
(at p18 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 19
2. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 19
3. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 19
4. (load p16 t0 l1)
   deleted: (at p16 l1)
   added: (in p16 t0)
   goals met: 0 of 19
5. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 0 of 19
6. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 0 of 19
7. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 19
8. (drive t0 l1 l0 level31 level3 level34)
   deleted: (at t0 l1) (fuel t0 level34)
   added: (at t0 l0) (fuel t0 level31)
   goals met: 0 of 19
9. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 19
10. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 19
11. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 19
12. (load p18 t0 l0)
   deleted: (at p18 l0)
   added: (in p18 t0)
   goals met: 0 of 19
13. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 0 of 19
14. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 19
15. (drive t0 l0 l2 level18 level13 level31)
   deleted: (at t0 l0) (fuel t0 level31)
   added: (at t0 l2) (fuel t0 level18)
   goals met: 0 of 19
16. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 19
17. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 2 of 19
18. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 3 of 19
19. (unload p18 t0 l2)
   deleted: (in p18 t0)
   added: (at p18 l2)
   goals met: 4 of 19
20. (unload p16 t0 l2)
   deleted: (in p16 t0)
   added: (at p16 l2)
   goals met: 5 of 19
21. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 6 of 19
22. (unload p14 t0 l2)
   deleted: (in p14 t0)
   added: (at p14 l2)
   goals met: 7 of 19
23. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 8 of 19
24. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 9 of 19
25. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 9 of 19
26. (load p17 t0 l2)
   deleted: (at p17 l2)
   added: (in p17 t0)
   goals met: 9 of 19
27. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 9 of 19
28. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 9 of 19
29. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 9 of 19
30. (drive t0 l2 l0 level5 level13 level18)
   deleted: (at t0 l2) (fuel t0 level18)
   added: (at t0 l0) (fuel t0 level5)
   goals met: 9 of 19
31. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 9 of 19
32. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 10 of 19
33. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 11 of 19
34. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 12 of 19
35. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 13 of 19
36. (drive t0 l0 l1 level2 level3 level5)
   deleted: (at t0 l0) (fuel t0 level5)
   added: (at t0 l1) (fuel t0 level2)
   goals met: 13 of 19
37. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 14 of 19
38. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 15 of 19
39. (unload p17 t0 l1)
   deleted: (in p17 t0)
   added: (at p17 l1)
   goals met: 16 of 19
40. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 17 of 19
41. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 18 of 19
42. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 19 of 19
